


* Part 1


#+BEGIN_SRC python :results output :session part2
import string

puzzleInput = list(map((lambda line : line.strip()), open("./day4.txt", "r").readlines()))
gameRemoved = list(map((lambda gameLess: "".join(gameLess.split(":")[1:]).strip()), puzzleInput))

winningSplit = list(map((lambda game: game.split("|")), gameRemoved))

convertedWin = list(map((lambda win: win.strip(" ").split(" ")), [item[0] for item in winningSplit]))
convertedNum = list(map((lambda num: num.strip(" ").split(" ")), [item[1] for item in winningSplit]))

def intFilterList(nums):
    numberList = []
    for num in nums:
        if num != "":
            numberList.append(int(num))

    return numberList

intWin = list(map(intFilterList, convertedWin))
intNum = list(map(intFilterList, convertedNum))

combined = list(zip(intWin, intNum))

def checkGame(game):
    winning = game[0]
    myNumbers = game[1]
    matches = 0
    for myNum in myNumbers:
        for winNum in winning:
            if winNum == myNum:
                matches += 1
    #print(won)
    #print(calcPoints(matches))
    return calcPoints(matches)

def calcPoints(matches):
    if matches == 1:
        return matches
    elif matches > 1:
        return (calcPoints(matches-1)*2)
    else:
        return 0


part1result = 0
for item in combined:
    part1result += checkGame(item)

#print(combined)

print(part1result)
#+END_SRC

#+RESULTS:
: 15205


* Part 2

#+BEGIN_SRC python :results output :session part2

cardDict = {}

for i in range(0, (len(combined))):
    cardDict[i] = 1

def checkGamePart2(game):
    winning = game[0]
    myNumbers = game[1]
    matches = 0
    for myNum in myNumbers:
        for winNum in winning:
            if winNum == myNum:
                matches += 1
    #print(matches)
    return matches

def assignCardCopies(position: int, matches: int, copies):
    for i in range(1, matches+1):
        cardDict[position + i] += copies


counter = 0
for game in combined:
    assignCardCopies(counter, checkGamePart2(game), cardDict[counter])
    counter += 1

part2result = 0
for key in cardDict:
    #print("key {}: value = {}".format(key, cardDict[key]))

    part2result += cardDict[key]

print(part2result)

#+END_SRC

#+RESULTS:
: 6189740
